In [36]:
import pandas as pd

In [37]:
df = pd.DataFrame(columns = ['Dinero Invertido','Mes'])

In [38]:
df

Empty DataFrame
Columns: [Dinero Invertido, Mes]
Index: []

In [39]:
datos = {'Dinero Invertido': 120, 'Mes': 'febrero'}
df = df.append(datos, ignore_index= True)
df

  Dinero Invertido      Mes
0              120  febrero

In [40]:
df2 ={'Dinero Invertido': 250,'Mes': 'febrero'}

df = df.append(df2, ignore_index = True)

df

  Dinero Invertido      Mes
0              120  febrero
1              250  febrero

In [41]:
def add_mony(df,a,b):
    df2 = {'Dinero Invertido':a,'Mes': b}
    df = df.append(df2, ignore_index = True)
    total = df['Dinero Invertido'].sum()

    return df,total

In [42]:
investimentos,total = add_mony(df,424,'abril')

In [43]:
investimentos,total = add_mony(investimentos,150,'noviembre')

In [44]:
investimentos

  Dinero Invertido        Mes
0              120    febrero
1              250    febrero
2              424      abril
3              150  noviembre

In [45]:
total

944